Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.1.162/atdf/PIC32CM2532LE00064.atdf
        <register modes="SPIS" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="SPIS Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C" values="SERCOM_SPIS_CTRLA__MODE"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
          <bitfield name="IBON" caption="Immediate Buffer Overflow Notification" mask="0x100" values="SERCOM_SPIM_CTRLA__IBON"/>
          <bitfield name="DOPO" caption="Data Out Pinout" mask="0x30000" values="SERCOM_SPIM_CTRLA__DOPO"/>
          <bitfield name="DIPO" caption="Data In Pinout" mask="0x300000" values="SERCOM_SPIM_CTRLA__DIPO"/>
          <bitfield name="FORM" caption="Frame Format" mask="0xF000000" values="SERCOM_SPIM_CTRLA__FORM"/>
          <bitfield name="CPHA" caption="Clock Phase" mask="0x10000000" values="SERCOM_SPIM_CTRLA__CPHA"/>
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x20000000" values="SERCOM_SPIM_CTRLA__CPOL"/>
          <bitfield name="DORD" caption="Data Order" mask="0x40000000" values="SERCOM_SPIM_CTRLA__DORD"/>
        </register>
        <register modes="USART_EXT" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="USART_EXT Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C" values="SERCOM_USART_CTRLA__MODE"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
          <bitfield name="IBON" caption="Immediate Buffer Overflow Notification" mask="0x100"/>
          <bitfield name="TXINV" caption="Transmit Data Invert" mask="0x200" values="SERCOM_USART_CTRLA__TXINV"/>
          <bitfield name="RXINV" caption="Receive Data Invert" mask="0x400" values="SERCOM_USART_CTRLA__RXINV"/>
          <bitfield name="SAMPR" caption="Sample" mask="0xE000" values="SERCOM_USART_CTRLA__SAMPR"/>
          <bitfield name="TXPO" caption="Transmit Data Pinout" mask="0x30000" values="SERCOM_USART_CTRLA__TXPO"/>
          <bitfield name="RXPO" caption="Receive Data Pinout" mask="0x300000" values="SERCOM_USART_CTRLA__RXPO"/>
          <bitfield name="SAMPA" caption="Sample Adjustment" mask="0xC00000" values="SERCOM_USART_CTRLA__SAMPA"/>
          <bitfield name="FORM" caption="Frame Format" mask="0xF000000" values="SERCOM_USART_CTRLA__FORM"/>
          <bitfield name="CMODE" caption="Communication Mode" mask="0x10000000" values="SERCOM_USART_CTRLA__CMODE"/>
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x20000000" values="SERCOM_USART_CTRLA__CPOL"/>
          <bitfield name="DORD" caption="Data Order" mask="0x40000000" values="SERCOM_USART_CTRLA__DORD"/>
        </register>
        <register modes="USART_INT" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="USART_INT Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C" values="SERCOM_USART_CTRLA__MODE"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
          <bitfield name="IBON" caption="Immediate Buffer Overflow Notification" mask="0x100"/>
          <bitfield name="TXINV" caption="Transmit Data Invert" mask="0x200" values="SERCOM_USART_CTRLA__TXINV"/>
          <bitfield name="RXINV" caption="Receive Data Invert" mask="0x400" values="SERCOM_USART_CTRLA__RXINV"/>
          <bitfield name="SAMPR" caption="Sample" mask="0xE000" values="SERCOM_USART_CTRLA__SAMPR"/>
          <bitfield name="TXPO" caption="Transmit Data Pinout" mask="0x30000" values="SERCOM_USART_CTRLA__TXPO"/>
          <bitfield name="RXPO" caption="Receive Data Pinout" mask="0x300000" values="SERCOM_USART_CTRLA__RXPO"/>
          <bitfield name="SAMPA" caption="Sample Adjustment" mask="0xC00000" values="SERCOM_USART_CTRLA__SAMPA"/>
          <bitfield name="FORM" caption="Frame Format" mask="0xF000000" values="SERCOM_USART_CTRLA__FORM"/>
          <bitfield name="CMODE" caption="Communication Mode" mask="0x10000000" values="SERCOM_USART_CTRLA__CMODE"/>
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x20000000" values="SERCOM_USART_CTRLA__CPOL"/>
          <bitfield name="DORD" caption="Data Order" mask="0x40000000" values="SERCOM_USART_CTRLA__DORD"/>
        </register>
        <register modes="I2CM" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="I2CM Control B">
          <bitfield name="SMEN" caption="Smart Mode Enable" mask="0x100"/>
          <bitfield name="QCEN" caption="Quick Command Enable" mask="0x200"/>
          <bitfield name="CMD" caption="Command" mask="0x30000"/>
          <bitfield name="ACKACT" caption="Acknowledge Action" mask="0x40000"/>
          <bitfield name="FIFOCLR" caption="FIFO Clear" mask="0xC00000" values="SERCOM_I2CM_CTRLB__FIFOCLR"/>
        </register>
        <register modes="I2CS" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="I2CS Control B">
          <bitfield name="SMEN" caption="Smart Mode Enable" mask="0x100"/>
          <bitfield name="GCMD" caption="PMBus Group Command" mask="0x200"/>
          <bitfield name="AACKEN" caption="Automatic Address Acknowledge" mask="0x400"/>
          <bitfield name="AMODE" caption="Address Mode" mask="0xC000" values="SERCOM_I2CS_CTRLB__AMODE"/>
          <bitfield name="CMD" caption="Command" mask="0x30000"/>
          <bitfield name="ACKACT" caption="Acknowledge Action" mask="0x40000"/>
          <bitfield name="FIFOCLR" caption="FIFO Clear" mask="0xC00000" values="SERCOM_I2CS_CTRLB__FIFOCLR"/>
        </register>
        <register modes="SPIM" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="SPIM Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="SERCOM_SPIM_CTRLB__CHSIZE"/>
          <bitfield name="PLOADEN" caption="Data Preload Enable" mask="0x40"/>
          <bitfield name="SSDE" caption="Slave Select Low Detect Enable" mask="0x200" values="SERCOM_SPIM_CTRLB__SSDE"/>
          <bitfield name="MSSEN" caption="Master Slave Select Enable" mask="0x2000" values="SERCOM_SPIM_CTRLB__MSSEN"/>
          <bitfield name="AMODE" caption="Address Mode" mask="0xC000" values="SERCOM_SPIM_CTRLB__AMODE"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
          <bitfield name="FIFOCLR" caption="FIFO Clear" mask="0xC00000" values="SERCOM_SPIM_CTRLB__FIFOCLR"/>
        </register>
        <register modes="SPIS" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="SPIS Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="SERCOM_SPIM_CTRLB__CHSIZE"/>
          <bitfield name="PLOADEN" caption="Data Preload Enable" mask="0x40"/>
          <bitfield name="SSDE" caption="Slave Select Low Detect Enable" mask="0x200" values="SERCOM_SPIM_CTRLB__SSDE"/>
          <bitfield name="MSSEN" caption="Master Slave Select Enable" mask="0x2000" values="SERCOM_SPIM_CTRLB__MSSEN"/>
          <bitfield name="AMODE" caption="Address Mode" mask="0xC000" values="SERCOM_SPIM_CTRLB__AMODE"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
          <bitfield name="FIFOCLR" caption="FIFO Clear" mask="0xC00000" values="SERCOM_SPIM_CTRLB__FIFOCLR"/>
        </register>
